{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "dense_1", "kernel_regularizer": null, "batch_input_shape": [null, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_4", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_5", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_6", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 64, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_7", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 64, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_8", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_9", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 32, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_10", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 16, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "name": "dense_11", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 16, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "trainable": true, "name": "dense_12", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 4, "use_bias": true}}], "backend": "tensorflow"}