{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"name": "model_5", "input_layers": [["input_headline", 0, 0], ["input_body", 0, 0]], "layers": [{"name": "input_headline", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_headline", "batch_input_shape": [null, 16], "sparse": false, "dtype": "float32"}}, {"name": "input_body", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_body", "batch_input_shape": [null, 48], "sparse": false, "dtype": "float32"}}, {"name": "embedding_9", "inbound_nodes": [[["input_headline", 0, 0, {}]]], "class_name": "Embedding", "config": {"name": "embedding_9", "embeddings_regularizer": null, "input_dim": 3255, "mask_zero": false, "batch_input_shape": [null, 16], "activity_regularizer": null, "trainable": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "output_dim": 50, "embeddings_constraint": null, "dtype": "float32", "input_length": 16}}, {"name": "embedding_10", "inbound_nodes": [[["input_body", 0, 0, {}]]], "class_name": "Embedding", "config": {"name": "embedding_10", "embeddings_regularizer": null, "input_dim": 23045, "mask_zero": false, "batch_input_shape": [null, 48], "activity_regularizer": null, "trainable": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "output_dim": 50, "embeddings_constraint": null, "dtype": "float32", "input_length": 48}}, {"name": "concatenate_5", "inbound_nodes": [[["embedding_9", 0, 0, {}], ["embedding_10", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_5", "axis": 1, "trainable": true}}, {"name": "lstm_2", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "name": "lstm_2", "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "tanh", "implementation": 1, "stateful": false, "return_sequences": false, "dropout": 0.0, "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 64, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "unroll": false, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"name": "dropout_2", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.25, "seed": null}}, {"name": "dense_12", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_12", "kernel_constraint": null, "units": 64, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"name": "dense_13", "inbound_nodes": [[["dense_12", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_13", "kernel_constraint": null, "units": 4, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null}}], "output_layers": [["dense_13", 0, 0]]}}