{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"name": "model_4", "input_layers": [["input_headline", 0, 0], ["input_body", 0, 0]], "layers": [{"name": "input_body", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_body", "batch_input_shape": [null, 64], "sparse": false, "dtype": "float32"}}, {"name": "input_headline", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_headline", "batch_input_shape": [null, 64], "sparse": false, "dtype": "float32"}}, {"name": "embedding_8", "inbound_nodes": [[["input_body", 0, 0, {}]]], "class_name": "Embedding", "config": {"name": "embedding_8", "embeddings_regularizer": null, "input_dim": 23226, "mask_zero": false, "batch_input_shape": [null, 64], "activity_regularizer": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "output_dim": 50, "embeddings_constraint": null, "dtype": "float32", "input_length": 64}}, {"name": "embedding_7", "inbound_nodes": [[["input_headline", 0, 0, {}]]], "class_name": "Embedding", "config": {"name": "embedding_7", "embeddings_regularizer": null, "input_dim": 23226, "mask_zero": false, "batch_input_shape": [null, 64], "activity_regularizer": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "output_dim": 50, "embeddings_constraint": null, "dtype": "float32", "input_length": 64}}, {"name": "dense_10", "inbound_nodes": [[["embedding_8", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_10", "kernel_constraint": null, "units": 16, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"name": "dense_9", "inbound_nodes": [[["embedding_7", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_9", "kernel_constraint": null, "units": 16, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"name": "concatenate_4", "inbound_nodes": [[["dense_10", 0, 0, {}], ["dense_9", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_4", "axis": -1, "trainable": true}}, {"name": "flatten_3", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}}, {"name": "dense_11", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_11", "kernel_constraint": null, "units": 4, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null}}], "output_layers": [["dense_11", 0, 0]]}}